## Plan Result (prod_frontendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw"
        name                              = "cft-aks-fe-00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (7 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.79.250",
              + "10.90.95.250",
            ]
          + name         = "sds-sandbox-build"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/adoption" -> null
          - name                                = "adoption" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/adoption" -> null
          - probe_name                          = "adoption" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cft-api-mgmt" -> null
          - name                                = "cft-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/cft-api-mgmt" -> null
          - probe_name                          = "cft-api-mgmt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cmc" -> null
          - name                                = "cmc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/cmc" -> null
          - probe_name                          = "cmc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cmc-legal" -> null
          - name                                = "cmc-legal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/cmc-legal" -> null
          - probe_name                          = "cmc-legal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/div-amend" -> null
          - name                                = "div-amend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/div-amend" -> null
          - probe_name                          = "div-amend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/div-da" -> null
          - name                                = "div-da" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/div-da" -> null
          - probe_name                          = "div-da" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/div-dn" -> null
          - name                                = "div-dn" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/div-dn" -> null
          - probe_name                          = "div-dn" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/div-pfe" -> null
          - name                                = "div-pfe" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/div-pfe" -> null
          - probe_name                          = "div-pfe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/div-rfe" -> null
          - name                                = "div-rfe" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/div-rfe" -> null
          - probe_name                          = "div-rfe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/dtsse-ardoq-adapter" -> null
          - name                                = "dtsse-ardoq-adapter" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/dtsse-ardoq-adapter" -> null
          - probe_name                          = "dtsse-ardoq-adapter" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/et-pet" -> null
          - name                                = "et-pet" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/et-pet" -> null
          - probe_name                          = "et-pet" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/et-response-pet" -> null
          - name                                = "et-response-pet" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/et-response-pet" -> null
          - probe_name                          = "et-response-pet" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/et-staff-pet" -> null
          - name                                = "et-staff-pet" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/et-staff-pet" -> null
          - probe_name                          = "et-staff-pet" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/et-sya" -> null
          - name                                = "et-sya" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/et-sya" -> null
          - probe_name                          = "et-sya" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/fact" -> null
          - name                                = "fact" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/fact" -> null
          - probe_name                          = "fact" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/fact-admin" -> null
          - name                                = "fact-admin" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/fact-admin" -> null
          - probe_name                          = "fact-admin" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/fact-redirect" -> null
          - name                                = "fact-redirect" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/fact-redirect" -> null
          - probe_name                          = "fact-redirect" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/fees-register" -> null
          - name                                = "fees-register" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/probes/fees-register" -> null
          - probe_name                          = "fees-register" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] ->

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

tionGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/sandbox-build"
          + name                       = "sandbox-build"
          + priority                   = 430
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/sptribs-frontend"
          + backend_address_pool_name  = "sptribs-frontend"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/sptribs-frontend"
          + backend_http_settings_name = "sptribs-frontend"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/sptribs-frontend"
          + http_listener_name         = "sptribs-frontend"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/sptribs-frontend"
          + name                       = "sptribs-frontend"
          + priority                   = 400
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/sscs-cor"
          + backend_address_pool_name  = "sscs-cor"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/sscs-cor"
          + backend_http_settings_name = "sscs-cor"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/sscs-cor"
          + http_listener_name         = "sscs-cor"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/sscs-cor"
          + name                       = "sscs-cor"
          + priority                   = 100
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/sscs-tribunals"
          + backend_address_pool_name  = "sscs-tribunals"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/sscs-tribunals"
          + backend_http_settings_name = "sscs-tribunals"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/sscs-tribunals"
          + http_listener_name         = "sscs-tribunals"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/sscs-tribunals"
          + name                       = "sscs-tribunals"
          + priority                   = 80
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/sscs-tya"
          + backend_address_pool_name  = "sscs-tya"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/sscs-tya"
          + backend_http_settings_name = "sscs-tya"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/sscs-tya"
          + http_listener_name         = "sscs-tya"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/sscs-tya"
          + name                       = "sscs-tya"
          + priority                   = 90
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-approve-org"
          + backend_address_pool_name  = "xui-approve-org"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-approve-org"
          + backend_http_settings_name = "xui-approve-org"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-approve-org"
          + http_listener_name         = "xui-approve-org"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-approve-org"
          + name                       = "xui-approve-org"
          + priority                   = 130
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-manage-org"
          + backend_address_pool_name  = "xui-manage-org"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-manage-org"
          + backend_http_settings_name = "xui-manage-org"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-manage-org"
          + http_listener_name         = "xui-manage-org"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-manage-org"
          + name                       = "xui-manage-org"
          + priority                   = 120
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-register-org"
          + backend_address_pool_name  = "xui-register-org"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-register-org"
          + backend_http_settings_name = "xui-register-org"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-register-org"
          + http_listener_name         = "xui-register-org"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-register-org"
          + name                       = "xui-register-org"
          + priority                   = 140
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-webapp"
          + backend_address_pool_name  = "xui-webapp"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-webapp"
          + backend_http_settings_name = "xui-webapp"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-webapp"
          + http_listener_name         = "xui-webapp"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-webapp"
          + name                       = "xui-webapp"
          + priority                   = 110
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-pet"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-pet"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-pet"
          + id                         = (known after apply)
          + name                       = "et-pet"
          + priority                   = 450
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-response-pet"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-response-pet"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-response-pet"
          + id                         = (known after apply)
          + name                       = "et-response-pet"
          + priority                   = 470
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-staff-pet"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-staff-pet"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-staff-pet"
          + id                         = (known after apply)
          + name                       = "et-staff-pet"
          + priority                   = 460
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hwf-pet"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hwf-pet"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hwf-pet"
          + id                         = (known after apply)
          + name                       = "hwf-pet"
          + priority                   = 500
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hwf-staff-pet"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hwf-staff-pet"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hwf-staff-pet"
          + id                         = (known after apply)
          + name                       = "hwf-staff-pet"
          + priority                   = 490
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sds-sandbox-build"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sds-sandbox-build"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sds-sandbox-build"
          + id                         = (known after apply)
          + name                       = "sds-sandbox-build"
          + priority                   = 440
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "tt-pet"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "tt-pet"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "tt-pet"
          + id                         = (known after apply)
          2m+ name                       = "tt-pet"
          + priority                   = 480
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (57 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw|app-gw-storage-account"
        name               = "app-gw-storage-account"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1834,"Program":"tfcmt","SHA1":"","Target":"prod_frontendappgateway","Vars":{}} -->